backend_src/test/load.findCountyNOI.yml
config:
  target: "https://noi-notification-system-qvo2g2xyga-uc.a.run.app"
  phases:
    - duration: 58
      arrivalRate: 1
      name: Warm Up
  payload:
    -
      path: "counties.csv"
      fields:
        - "county_cd"
        - "startDate"
        - "endDate"
    -
      path: "dates.csv"
      fields:
        - "startDate"
        - "endDate"
scenarios:
  - flow:
      - get:
          url: "/findCountyNOI?counties={{county_cd}}&startDate={{startDate}}&endDate={{endDate}}"