backend_src/test/load.findNearbyNOI.yml
config:
  target: "https://noi-notification-system-qvo2g2xyga-uc.a.run.app"
  http:
    timeout: 30
  phases:
    - duration: 30
      arrivalRate: 2
      name: Warm Up
  payload:
    path: "testCoordinates.csv"
    fields:
      - "latitude"
      - "longitude"
      - "radius"
scenarios:
  - flow:
      - get:
          url: "/findNearbyNOI?latitude={{latitude}}&longitude={{longitude}}
          &radius={{radius}}&orderParam=time&order=ASC"